vegemite_backup/app/views/reservations/_form.html.erb

SELECT "vegetables".* FROM "vegetables" INNER JOIN "gardens_vegetables" ON "vegetables"."id" = "gardens_vegetables"."vegetable_id" WHERE "gardens_vegetables"."garden_id" = ?  [["garden_id", 1]]
---

  Veggies: <% @garden.vegetables.each do |vegetable| %>