vegemite_backup/app/views/gardens/show.html.erb

SELECT "vegetables".* FROM "vegetables" INNER JOIN "gardens_vegetables" ON "vegetables"."id" = "gardens_vegetables"."vegetable_id" WHERE "gardens_vegetables"."garden_id" = ?  [["garden_id", 1]]
---
  About: <%= @garden.description %></br>
  Veggies: <% @garden.vegetables.each do |vegetable| %>