app/controllers/gardens_controller.rb

    def index
        @gardens = Garden.all
---
SELECT "gardens".* FROM "gardens"

    def show
        @garden = Garden.find(params[:id])
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]