app/controllers/reservations_controller.rb

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @garden = Garden.find(params[:garden_id])
    @reservation = Reservation.find(params[:id])

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("grower_id", "garden_id", "note", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?, ?, ?)  [["grower_id", 21], ["garden_id", 2], ["note", ""], ["created_at", 2016-12-13 02:40:57 UTC], ["updated_at", 2016-12-13 02:40:57 UTC], ["date", 2017-12-14 02:40:00 UTC]]
---
  def create
    @garden = Garden.find(params[:garden_id])
    @reservation = @garden.reservations.build(reservation_params)
      if isoverlap(@garden) == false
        @reservation.user = current_user
        if @reservation.save

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_garden
    @garden = Garden.find(params[:garden_id])